Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/languages-omegat.tmx
Source language: en_us
Languages: pt_br

source: Generic Languages Framework
pt_br: Framework genérico de linguagens

source: Languages Support
pt_br: Suporte à linguagens

source: Generic Support for Integration of Programming Languages into NetBeans IDE
pt_br: Suporte genérico para integração de linguagens de programação dentro do NetBeans IDE

source: Languages Manager
pt_br: Gerenciador de linguagens

source: NetBeans Syntax Definitions
pt_br: Definições de sintaxe do NetBeans

source: NetBeans Syntax
pt_br: Sintaxe do NetBeans

source: Error
pt_br: Erro

source: NBS File
pt_br: Arquivo NBS

source: Keyword
pt_br: Palavra-chave

source: Comment
pt_br: Comentário

source: Number
pt_br: Número

source: Identifier
pt_br: Identificador

source: Operator
pt_br: Operador

source: Whitespace
pt_br: Espaço em branco

source: Syntax error.
pt_br: Erro de sintaxe.

source: Unexpected character.
pt_br: Caractere inesperado.

source: Inplace Refactoring
pt_br: Refatoração embutida

source: Go To Declaration
pt_br: Ir para declaração

source: Tokens View
pt_br: Visualizar símbolos

source: Tokens
pt_br: Símbolos

source: This is a Tokens Browser window
pt_br: Esta é uma janela de navegação de símbolos

source: AST View
pt_br: Visualizar AST

source: This is a AST Browser window
pt_br: Esta é uma janela de navegação AST

source: Rename
pt_br: Renomear

source: &New Name:
pt_br: &Novo nome:

source: Apply Rename on &Comments
pt_br: Renomear também em &comentários

source: Rename <b>{0}</b> to <b>{1}</b>
pt_br: Renamear <b>{0}</b> para <b>{1}</b>

source: Fi&nd Usages
pt_br: P&rocurar utilizações

source: Find Usages
pt_br: Procurar utilizações

source: Usages of <b>{0}</b>
pt_br: Utilizações de <b>{0}</b>

source: Cannot perform rename on element at selected position.
pt_br: Não pode renomear elemento na posição selecionada.

source: Cannot find usages of element at selected position.
pt_br: Não pode encontrar utilizações do elemento na posição selecionada.

source: The name has not been modified.
pt_br: O nome não foi modificado.

source: No changes will be performed.
pt_br: Nenhuma alteração realizada.

source: New name must be entered.
pt_br: Novo nome deve ser informado.

source: {0} is not a valid JavaScript identifier.
pt_br: {0} não é um identificador JavaScript válido.

source: mf Files
pt_br: Arquivos mf

source: Languages Options
pt_br: Oções de linguagens

source: {0} Editor
pt_br: Editor {0}

source: Enable Code Folding
pt_br: Habilita o dobramento de código

source: .manifest file Editor Support
pt_br: Suporte ao editor de arquivo .manifest

source: Support for editing .manifest files.
pt_br: Suporte para edição de arquivos .manifest.

source: Manifest File
pt_br: Arquivo Manifest

source: Manifest Files
pt_br: Arquivos Manifest

source: Line Comment
pt_br: Comentário de linha

source: Key
pt_br: Chave

source: Value
pt_br: Valor

source: CSS Editor Support
pt_br: Suporte ao editor de CSS

source: Support for editing CSS files.
pt_br: Suporte para edição de arquivos CSS.

source: CSS Files
pt_br: Arquivos CSS

source: Inlined CSS
pt_br: CSS embutido

source: Selector
pt_br: Seletor

source: Escaped Number
pt_br: Número de escape

source: Expand CSS Rulesets
pt_br: Expandir conjunto de regras CSS

source: Collapse CSS Rulesets
pt_br: Ocultar conjunto de regras CSS

source: Expand CSS Comments
pt_br: Expandir comentários CSS

source: Collapse CSS Comments
pt_br: Ocultar comentários CSS

source: Sample Text
pt_br: Texto de exemplo

source: Creates empty YAML file.
pt_br: Cria um arquivo YAML vazio.

source: You can edit the file in the IDE's Source Editor.
pt_br: Você pode editar o arquivo no editor de código-fonte do IDE.

source: To change this template, choose Tools | Template Manager and open the template in the editor.
pt_br: Para alterar este modelo, escolha Ferramentas | Gerenciador de modelos e abra o modelo no editor.

source: YAML Editor Support
pt_br: Suporte ao editor YAML

source: Support for editing YAML files.
pt_br: Suporte para edição de arquivos YAML.

source: YAML Files
pt_br: Arquivos YAML

source: YAML File
pt_br: Arquivo YAML

source: Sequence
pt_br: Sequência

source: .diff File Editor Support
pt_br: Suporte ao editor de arquivo .diff

source: Support for editing .diff files.
pt_br: Suporte para edição de arquivos .diff.

source: Diff File
pt_br: Arquivo de comparação

source: Bat Files
pt_br: Arquivos bat

source: Index
pt_br: Índice

source: Header
pt_br: Cabeçalho

source: Added Line
pt_br: Linha adicionada

source: Removed Line
pt_br: Linha removida

source: Plain Text
pt_br: Texto puro

source: File Name
pt_br: Nome do arquivo
